In [1]:
import pandas as pd
import numpy as np

# Market Cap Cleaning

In [2]:
market_cap=pd.read_csv('/home/choobs96/Data Mining/Ori_data/Property_Market_Cap.csv',sep="|").drop(['Unnamed: 0'], axis=1)

In [3]:
market_cap.columns

Index(['Company Name', 'Company Code', 'Company Code KL', 'URL', 'Market Cap',
       'Last Price', 'Price/Earning', 'Divident Yield', 'Return of Equity',
       'Market Cap Float'],
      dtype='object')

Rename the columns for Market Cap data

In [4]:
market_cap.columns=['Company_Name',
 'Company_Code',
 'Company_Code_KL',
 'URL',
 'Market_Cap',
 'Last_Price',
 'Price_per_Earning',
 'Divident_Yield',
 'Return_of_Equity',
 'Market_Cap_Float']

In [5]:
market_cap

,Company_Name,Company_Code,Company_Code_KL,URL,Market_Cap,Last_Price,Price_per_Earning,Divident_Yield,Return_of_Equity,Market_Cap_Float
0,IOIPG,5249,5249.KL,https://www.malaysiastock.biz/Corporate-Infoma...,4.735b,0.86,7.06,3.49,3.55,4.735000e+09
1,SIMEPROP,5288,5288.KL,https://www.malaysiastock.biz/Corporate-Infoma...,3.740b,0.55,6.25,5.45,6.15,3.740000e+09
2,UOADEV,5200,5200.KL,https://www.malaysiastock.biz/Corporate-Infoma...,2.951b,1.50,7.39,9.33,7.87,2.951000e+09
3,SPSETIA,8664,8664.KL,https://www.malaysiastock.biz/Corporate-Infoma...,2.830b,0.70,7.63,1.43,3.04,2.830000e+09
4,IGBB,5606,5606.KL,https://www.malaysiastock.biz/Corporate-Infoma...,2.355b,2.65,11.28,1.13,4.43,2.355000e+09
5,MRCB,1651,1651.KL,https://www.malaysiastock.biz/Corporate-Infoma...,1.478b,0.34,62.04,2.99,0.50,1.478000e+09
6,OSK,5053,5053.KL,https://www.malaysiastock.biz/Corporate-Infoma...,1.467b,0.70,3.56,7.14,8.16,1.467000e+09
7,YNHPROP,3158,3158.KL,https://www.malaysiastock.biz/Corporate-Infoma...,1.354b,2.56,32.12,0.00,3.62,1.354000e+09
8,MATRIX,5236,5236.KL,https://www.malaysiastock.biz/Corporate-Infoma...,1.293b,1.55,5.29,8.23,15.35,1.293000e+09
9,UEMS,5148,5148.KL,https://www.malaysiastock.biz/Corporate-Infoma...,1.293b,0.29,5.78,0.00,3.06,1.293000e+09

Check null value in the data

In [6]:
market_cap.isnull().sum()

Company_Name         0
Company_Code         0
Company_Code_KL      0
URL                  0
Market_Cap           0
Last_Price           0
Price_per_Earning    0
Divident_Yield       0
Return_of_Equity     0
Market_Cap_Float     0
dtype: int64

Since there is no Null value in this data, we just need to check the data type e.g String, Integer or Float to standardize the data

In [7]:
market_cap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company_Name       10 non-null     object
 1   Company_Code       10 non-null     int64
 2   Company_Code_KL    10 non-null     object
 3   URL                10 non-null     object
 4   Market_Cap         10 non-null     object
 5   Last_Price         10 non-null     float64
 6   Price_per_Earning  10 non-null     float64
 7   Divident_Yield     10 non-null     float64
 8   Return_of_Equity   10 non-null     float64
 9   Market_Cap_Float   10 non-null     float64
dtypes: float64(5), int64(1), object(4)
memory usage: 928.0+ bytes

In [8]:
market_cap.to_csv("Property_Market_Cap_cleaned.csv",sep = "|")

# Bursa Cleaning

In [9]:
bursa=pd.read_csv('/home/choobs96/Data Mining/Ori_data/Bursa_Announcement.csv',sep="|").drop(['Unnamed: 0'], axis=1)

In [10]:
bursa.head()

,Announcement Date,Company Name,Title,Company Code
0,18 Mar 2020,IOI PROPERTIES GROUP BERHAD,Changes in Sub. S-hldr's Int (Section 138 of C...,5249
1,17 Mar 2020,IOI PROPERTIES GROUP BERHAD,DEALINGS IN LISTED SECURITIES (CHAPTER 14 OF L...,5249
2,17 Mar 2020,IOI PROPERTIES GROUP BERHAD,Changes in Sub. S-hldr's Int (Section 138 of C...,5249
3,17 Mar 2020,IOI PROPERTIES GROUP BERHAD,Changes in Sub. S-hldr's Int (Section 138 of C...,5249
4,17 Mar 2020,IOI PROPERTIES GROUP BERHAD,Changes in Director's Interest (Section 219 of...,5249

In [11]:
bursa.columns

Index(['Announcement Date', 'Company Name', 'Title', 'Company Code'], dtype='object')

Rename the columns for Bursa data

In [12]:
bursa.columns =['Announcement_Date', 'Company_Name', 'Title', 'Company_Code']

Check the column type and make necessary changes (Change the Announcement Date column to datetime format)

In [13]:
bursa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3015294 entries, 0 to 3015293
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   Announcement_Date  object
 1   Company_Name       object
 2   Title              object
 3   Company_Code       int64
dtypes: int64(1), object(3)
memory usage: 92.0+ MB

In [14]:
bursa['Announcement_Date'] = pd.to_datetime(bursa['Announcement_Date'])

Check null value in the data

In [15]:
bursa.isnull().sum()

Announcement_Date    0
Company_Name         0
Title                0
Company_Code         0
dtype: int64

Double check the data type for each column

In [16]:
bursa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3015294 entries, 0 to 3015293
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   Announcement_Date  datetime64[ns]
 1   Company_Name       object
 2   Title              object
 3   Company_Code       int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 92.0+ MB

In [17]:
bursa.to_csv("Bursa_Announcement_cleaned.csv",sep = "|")

# Historical Price Cleaning

In [18]:
historical=pd.read_csv('/home/choobs96/Data Mining/Ori_data/Historical_Price.csv',sep="|").drop(['Unnamed: 0'], axis=1)

In [19]:
historical.head(10)

,Date,High,Low,Open,Close,Volume,Adj Close,Company Code KL
0,2014-01-15,3.21460,2.71796,2.89855,2.79923,73229619.0,2.323783,5249.KL
1,2014-01-16,2.81729,2.60057,2.79923,2.63669,49003730.0,2.188851,5249.KL
2,2014-01-20,2.75408,2.68184,2.71796,2.73602,19515133.0,2.271310,5249.KL
3,2014-01-21,2.70893,2.68184,2.69990,2.69990,13927056.0,2.241324,5249.KL
4,2014-01-22,2.71796,2.62766,2.69990,2.63669,25070650.0,2.188851,5249.KL
5,2014-01-23,2.63669,2.53736,2.63669,2.55542,33520043.0,2.121384,5249.KL
6,2014-01-24,2.59154,2.53736,2.55542,2.57348,9208438.0,2.136377,5249.KL
7,2014-01-27,2.58251,2.43804,2.51930,2.47415,21669232.0,2.053918,5249.KL
8,2014-01-28,2.48318,2.41095,2.45609,2.44707,25474426.0,2.031437,5249.KL
9,2014-01-29,2.48318,2.40192,2.43804,2.41095,15598750.0,2.001452,5249.KL

In [20]:
historical.columns

Index(['Date', 'High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close',
       'Company Code KL'],
      dtype='object')

Rename the column accordingly

In [21]:
historical.columns=['Date_',
 'High_P',
 'Low_P',
 'Open_P',
 'Close_P',
 'Volume',
 'Adj_Close',
 'Company_Code_KL']

Check for null item in Historical Price

In [22]:
historical.isnull().sum()

Date_              0
High_P             0
Low_P              0
Open_P             0
Close_P            0
Volume             0
Adj_Close          0
Company_Code_KL    0
dtype: int64

Check the column type and make necessary changes (Change the Date column to datetime format)

In [23]:
historical.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16976 entries, 0 to 16975
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date_            16976 non-null  object
 1   High_P           16976 non-null  float64
 2   Low_P            16976 non-null  float64
 3   Open_P           16976 non-null  float64
 4   Close_P          16976 non-null  float64
 5   Volume           16976 non-null  float64
 6   Adj_Close        16976 non-null  float64
 7   Company_Code_KL  16976 non-null  object
dtypes: float64(6), object(2)
memory usage: 1.0+ MB

In [24]:
historical['Date_']= pd.to_datetime(historical['Date_'])

In [25]:
historical.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16976 entries, 0 to 16975
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date_            16976 non-null  datetime64[ns]
 1   High_P           16976 non-null  float64
 2   Low_P            16976 non-null  float64
 3   Open_P           16976 non-null  float64
 4   Close_P          16976 non-null  float64
 5   Volume           16976 non-null  float64
 6   Adj_Close        16976 non-null  float64
 7   Company_Code_KL  16976 non-null  object
dtypes: datetime64[ns](1), float64(6), object(1)
memory usage: 1.0+ MB

In [26]:
historical.to_csv("Historical_Price_cleaned.csv",sep = "|")

#  Cleaning KLSE Historical Data

In [27]:
klse=pd.read_csv('/home/choobs96/Data Mining/Ori_data/KLSE_Historical_data.csv',sep="|").drop(['Unnamed: 0'], axis=1)

Rename the column accordingly

In [28]:
klse.columns

Index(['Date', 'Open', 'High', 'Low', 'Close*', 'Adj Close**', 'Volume'], dtype='object')

In [29]:
klse_col=['Date_', 'Open_P', 'High_P', 'Low_P', 'Close_P', 'Adj_Close', 'Volume']

In [30]:
klse.columns = klse_col

Check for null values

In [31]:
klse.isnull().sum()

Date_        0
Open_P       0
High_P       0
Low_P        0
Close_P      0
Adj_Close    0
Volume       0
dtype: int64

In [32]:
klse.head()

        Date_    Open_P    High_P     Low_P   Close_P Adj_Close       Volume
0  Dec31,2019  1,609.37  1,610.69  1,588.76  1,588.76  1,588.76  104,601,300
1  Dec30,2019  1,609.45  1,617.43  1,608.76  1,615.67  1,615.67   82,149,800
2  Dec27,2019  1,599.93  1,610.91  1,598.48  1,610.61  1,610.61   63,765,200
3  Dec26,2019  1,604.68  1,607.12  1,602.66  1,603.55  1,603.55   22,687,500
4  Dec24,2019  1,613.83  1,613.87  1,602.10  1,604.23  1,604.23   34,847,100

Since the date is in string format, we created a date conversion function to convert it to YYYY-MM-DD date-time format

In [33]:
test_date= 'Dec31,2019'

In [34]:
def convert_date(i):
    month=i[:3]
    day=i[3:5]
    year=i[6:]
    output = year+'-'+month+'-'+day
    return output

In [35]:
convert_date(test_date)

'2019-Dec-31'

In [36]:
klse['Date_']=klse['Date_'].apply(convert_date)

In [37]:
klse['Date_']= pd.to_datetime(klse['Date_'])

Check the conversion.

In [38]:
klse

          Date_    Open_P    High_P     Low_P   Close_P Adj_Close       Volume
0    2019-12-31  1,609.37  1,610.69  1,588.76  1,588.76  1,588.76  104,601,300
1    2019-12-30  1,609.45  1,617.43  1,608.76  1,615.67  1,615.67   82,149,800
2    2019-12-27  1,599.93  1,610.91  1,598.48  1,610.61  1,610.61   63,765,200
3    2019-12-26  1,604.68  1,607.12  1,602.66  1,603.55  1,603.55   22,687,500
4    2019-12-24  1,613.83  1,613.87  1,602.10  1,604.23  1,604.23   34,847,100
...         ...       ...       ...       ...       ...       ...          ...
2465 2010-01-08  1,294.93  1,295.51  1,290.86  1,292.98  1,292.98   74,587,200
2466 2010-01-07  1,293.69  1,299.70  1,290.36  1,291.42  1,291.42  115,024,400
2467 2010-01-06  1,288.86  1,296.44  1,288.02  1,293.17  1,293.17  117,740,300
2468 2010-01-05  1,278.26  1,290.55  1,278.26  1,288.24  1,288.24  136,646,600
2469 2010-01-04  1,272.31  1,275.75  1,272.25  1,275.75  1,275.75   56,508,200

[2470 rows x 7 columns]

Note that all of the other column should be in float instead of string

In [39]:
klse.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2470 entries, 0 to 2469
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date_      2470 non-null   datetime64[ns]
 1   Open_P     2470 non-null   object
 2   High_P     2470 non-null   object
 3   Low_P      2470 non-null   object
 4   Close_P    2470 non-null   object
 5   Adj_Close  2470 non-null   object
 6   Volume     2470 non-null   object
dtypes: datetime64[ns](1), object(6)
memory usage: 135.2+ KB

Note that there's a ',' in each column that should be removed to be converted to float. When converting to float we found out that the columns has "-" which represents null. So these are replaced with NaN.

In [40]:
for i in klse_col:
    if i!='Date_':
        klse[i]=klse[i].str.replace(',', '').replace('-', np.nan ).astype(float)

Save a copy for future use

In [41]:
klse_null = klse #values with null

In [42]:
klse_null.isnull().sum()

Date_         0
Open_P       21
High_P       21
Low_P        21
Close_P      21
Adj_Close    21
Volume       32
dtype: int64

Check the column type again

In [43]:
klse.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2470 entries, 0 to 2469
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date_      2470 non-null   datetime64[ns]
 1   Open_P     2449 non-null   float64
 2   High_P     2449 non-null   float64
 3   Low_P      2449 non-null   float64
 4   Close_P    2449 non-null   float64
 5   Adj_Close  2449 non-null   float64
 6   Volume     2438 non-null   float64
dtypes: datetime64[ns](1), float64(6)
memory usage: 135.2 KB

Drop null rows

In [44]:
klse_removed_na=klse.dropna()

In [45]:
klse_removed_na

          Date_   Open_P   High_P    Low_P  Close_P  Adj_Close       Volume
0    2019-12-31  1609.37  1610.69  1588.76  1588.76    1588.76  104601300.0
1    2019-12-30  1609.45  1617.43  1608.76  1615.67    1615.67   82149800.0
2    2019-12-27  1599.93  1610.91  1598.48  1610.61    1610.61   63765200.0
3    2019-12-26  1604.68  1607.12  1602.66  1603.55    1603.55   22687500.0
4    2019-12-24  1613.83  1613.87  1602.10  1604.23    1604.23   34847100.0
...         ...      ...      ...      ...      ...        ...          ...
2465 2010-01-08  1294.93  1295.51  1290.86  1292.98    1292.98   74587200.0
2466 2010-01-07  1293.69  1299.70  1290.36  1291.42    1291.42  115024400.0
2467 2010-01-06  1288.86  1296.44  1288.02  1293.17    1293.17  117740300.0
2468 2010-01-05  1278.26  1290.55  1278.26  1288.24    1288.24  136646600.0
2469 2010-01-04  1272.31  1275.75  1272.25  1275.75    1275.75   56508200.0

[2438 rows x 7 columns]

In [46]:
klse_removed_na.to_csv('KLSE_Historical_data_cleaned.csv',sep = "|")

# Quarter Report data cleaning

In [47]:
quarter=pd.read_csv('/home/choobs96/Data Mining/Ori_data/Scraped_data_property.csv',sep="|").drop(['Unnamed: 0'], axis=1)

In [48]:
quarter.columns

Index(['Date', 'Financial Year', 'No. ', 'Financial Quarter',
       'Revenue (RM,000)', 'PBT (RM,000)', 'Net Profit (RM,000)', 'EPS (Cent)',
       'Dividend (Cent)', 'NTA (RM)', 'YoY (%)', 'Company Code'],
      dtype='object')

Rename the columns accordingly

In [49]:
quarter_col= ['Date_',
 'Financial_Year',
 'Quarter_No',
 'Financial_Quarter',
 'Revenue_K',
 'PBT_K',
 'Net_Profit_K',
 'EPS_Cent',
 'Dividend_Cent',
 'NTA',
 'YoY_percent',
 'Company_Code']

In [50]:
quarter.columns = quarter_col

In [51]:
quarter.head()

,Date_,Financial_Year,Quarter_No,Financial_Quarter,Revenue_K,PBT_K,Net_Profit_K,EPS_Cent,Dividend_Cent,NTA,YoY_percent,Company_Code
0,25 Feb 2020,30 Jun 2020,2,31 Dec 2019,"564,129","286,301","199,749",3.63,0.0,3.43,7%,5249
1,25 Nov 2019,30 Jun 2020,1,30 Sep 2019,"540,315","255,649","136,636",2.48,0.0,3.40,22%,5249
2,29 Aug 2019,30 Jun 2019,4,30 Jun 2019,"497,791","227,892","139,768",2.54,3.0,3.42,47%,5249
3,27 May 2019,30 Jun 2019,3,31 Mar 2019,"487,739","300,902","194,700",3.54,0.0,3.38,17%,5249
4,26 Feb 2019,30 Jun 2019,2,31 Dec 2018,"666,150","355,012","214,864",3.90,0.0,3.36,97%,5249

Check column type

In [52]:
quarter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date_              385 non-null    object
 1   Financial_Year     385 non-null    object
 2   Quarter_No         385 non-null    object
 3   Financial_Quarter  385 non-null    object
 4   Revenue_K          385 non-null    object
 5   PBT_K              385 non-null    object
 6   Net_Profit_K       385 non-null    object
 7   EPS_Cent           385 non-null    float64
 8   Dividend_Cent      385 non-null    float64
 9   NTA                385 non-null    float64
 10  YoY_percent        385 non-null    object
 11  Company_Code       385 non-null    int64
dtypes: float64(3), int64(1), object(8)
memory usage: 36.2+ KB

Change the column to suitable type and replace , for int float values and replace '-' to np.nan

In [53]:
quarter['Date_'] = pd.to_datetime(quarter['Date_'])
quarter['Financial_Year'] = pd.to_datetime(quarter['Financial_Year'])
quarter['Financial_Quarter'] = pd.to_datetime(quarter['Financial_Quarter'])
quarter['Quarter_No']=quarter['Quarter_No'].replace('-', np.nan).astype(float)
quarter['Revenue_K']=quarter['Revenue_K'].str.replace(',', '').astype(float)
quarter['PBT_K']=quarter['PBT_K'].str.replace(',', '').astype(float)
quarter['Net_Profit_K']=quarter['Net_Profit_K'].str.replace(',', '').astype(float)

In [54]:
quarter.head()

,Date_,Financial_Year,Quarter_No,Financial_Quarter,Revenue_K,PBT_K,Net_Profit_K,EPS_Cent,Dividend_Cent,NTA,YoY_percent,Company_Code
0,2020-02-25,2020-06-30,2.0,2019-12-31,564129.0,286301.0,199749.0,3.63,0.0,3.43,7%,5249
1,2019-11-25,2020-06-30,1.0,2019-09-30,540315.0,255649.0,136636.0,2.48,0.0,3.40,22%,5249
2,2019-08-29,2019-06-30,4.0,2019-06-30,497791.0,227892.0,139768.0,2.54,3.0,3.42,47%,5249
3,2019-05-27,2019-06-30,3.0,2019-03-31,487739.0,300902.0,194700.0,3.54,0.0,3.38,17%,5249
4,2019-02-26,2019-06-30,2.0,2018-12-31,666150.0,355012.0,214864.0,3.90,0.0,3.36,97%,5249

Check column type

In [55]:
quarter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date_              385 non-null    datetime64[ns]
 1   Financial_Year     385 non-null    datetime64[ns]
 2   Quarter_No         373 non-null    float64
 3   Financial_Quarter  385 non-null    datetime64[ns]
 4   Revenue_K          385 non-null    float64
 5   PBT_K              385 non-null    float64
 6   Net_Profit_K       385 non-null    float64
 7   EPS_Cent           385 non-null    float64
 8   Dividend_Cent      385 non-null    float64
 9   NTA                385 non-null    float64
 10  YoY_percent        385 non-null    object
 11  Company_Code       385 non-null    int64
dtypes: datetime64[ns](3), float64(7), int64(1), object(1)
memory usage: 36.2+ KB

Check for null rows

In [56]:
quarter.isnull().sum()

Date_                 0
Financial_Year        0
Quarter_No           12
Financial_Quarter     0
Revenue_K             0
PBT_K                 0
Net_Profit_K          0
EPS_Cent              0
Dividend_Cent         0
NTA                   0
YoY_percent           0
Company_Code          0
dtype: int64

In [57]:
quarter_null = quarter

In [58]:
quarter_remove_na=quarter.dropna()

In [59]:
quarter_remove_na.isnull().sum()

Date_                0
Financial_Year       0
Quarter_No           0
Financial_Quarter    0
Revenue_K            0
PBT_K                0
Net_Profit_K         0
EPS_Cent             0
Dividend_Cent        0
NTA                  0
YoY_percent          0
Company_Code         0
dtype: int64

In [60]:
quarter_remove_na.to_csv("Scraped_data_property_cleaned.csv",sep = "|")